/***************************************************
module	:seg7_decoder
input	:四位需要译码的BCD码
output	:七段数码管的段码输出
function:在DE2开发板上实现了4位数码管译码

***************************************************/
module seg7_decoder(
	dat1_i,
	dat2_i,
	dat3_i,
	dat4_i,
	seg1_o,
	seg2_o,
	seg3_o,
	seg4_o
	); 

	input	[3:0]	dat1_i;				//第1位要显示的数据
	input	[3:0]	dat2_i;				//第2位要显示的数据
	input	[3:0]	dat3_i;				//第3位要显示的数据
	input	[3:0]	dat4_i;				//第4位要显示的数据
	
	output	[6:0]	seg1_o;				//第1位数据译码输出		
	output	[6:0]	seg2_o;				//第2位数据译码输出
	output	[6:0]	seg3_o;				//第3位数据译码输出
	output	[6:0]	seg4_o;				//第4位数据译码输出
	
	//输出寄存器定义								
	reg		[6:0]	seg1_o;				
	reg		[6:0]	seg2_o;				
	reg		[6:0]	seg3_o;				
	reg		[6:0]	seg4_o;
	
	always @(*)begin
		case(dat1_i)				//第1位数据七段译码	
	//---------------------------------数字-----------------------------------//	
			4'h0:seg1_o=7'b1000000;	//显示0
			4'h1:seg1_o=7'b1111001;	//显示1
			4'h2:seg1_o=7'b0100100;	//显示2
			4'h3:seg1_o=7'b0110000;	//显示3
			4'h4:seg1_o=7'b0011001;	//显示4
			4'h5:seg1_o=7'b0010010;	//显示5
			4'h6:seg1_o=7'b0000010;	//显示6
			4'h7:seg1_o=7'b1111000;	//显示7
			4'h8:seg1_o=7'b0000000;	//显示8
			4'h9:seg1_o=7'b0011000;	//显示9		
			default:seg1_o=7'b1111111;//不显示
		endcase
	end

	always @(*)begin
		case(dat2_i)				//第2位数据七段译码	
	//---------------------------------数字-----------------------------------//	
			4'h0:seg2_o=7'b1000000;	//显示0
			4'h1:seg2_o=7'b1111001;	//显示1
			4'h2:seg2_o=7'b0100100;	//显示2
			4'h3:seg2_o=7'b0110000;	//显示3
			4'h4:seg2_o=7'b0011001;	//显示4
			4'h5:seg2_o=7'b0010010;	//显示5
			4'h6:seg2_o=7'b0000010;	//显示6
			4'h7:seg2_o=7'b1111000;	//显示7
			4'h8:seg2_o=7'b0000000;	//显示8
			4'h9:seg2_o=7'b0011000;	//显示9
			default:seg2_o=7'b1111111;//不显示
		endcase
	end

	always @(*)begin
		case(dat3_i)				//第3位数据七段译码	
	//---------------------------------数字-----------------------------------//	
			4'h0:seg3_o=7'b1000000;	//显示0
			4'h1:seg3_o=7'b1111001;	//显示1
			4'h2:seg3_o=7'b0100100;	//显示2
			4'h3:seg3_o=7'b0110000;	//显示3
			4'h4:seg3_o=7'b0011001;	//显示4
			4'h5:seg3_o=7'b0010010;	//显示5
			4'h6:seg3_o=7'b0000010;	//显示6
			4'h7:seg3_o=7'b1111000;	//显示7
			4'h8:seg3_o=7'b0000000;	//显示8
			4'h9:seg3_o=7'b0011000;	//显示9
			default:seg3_o=7'b1111111;//不显示
		endcase
	end

	always @(*)begin
		case(dat4_i)				//第4位数据七段译码	
	//---------------------------------数字-----------------------------------//	
			4'h0:seg4_o=7'b1000000;	//显示0
			4'h1:seg4_o=7'b1111001;	//显示1
			4'h2:seg4_o=7'b0100100;	//显示2
			4'h3:seg4_o=7'b0110000;	//显示3
			4'h4:seg4_o=7'b0011001;	//显示4
			4'h5:seg4_o=7'b0010010;	//显示5
			4'h6:seg4_o=7'b0000010;	//显示6
			4'h7:seg4_o=7'b1111000;	//显示7
			4'h8:seg4_o=7'b0000000;	//显示8
			4'h9:seg4_o=7'b0011000;	//显示9		
			default:seg4_o=7'b1111111;//不显示
		endcase
	end
	
endmodule
